Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraintData.ReleaseTypeEnum Enumeration
 Defines the release type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ReleaseTypeEnum
Public Enumeration ReleaseTypeEnum
Members
Member name | Value | Description
FIXED_SUPPORTED | 0 |  The fixed and supported type.
PINNED_SUPPORTED | 1 |  The pinned and supported type.
FIXED_CONNECTED | 2 |  The fixed and connected type.
PINNED_CONNECTED | 3 |  The pinned and connected type.
USER_DEFINED | 4 |  The user defined type.
See Also
Reference
Tekla.Structures.Analysis Namespace